---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Entity.WriteAccessGranted
source: html/c2fb6fe9-83e5-87a7-58a9-57dce4962fba.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Entity.WriteAccessGranted Method

Checks whether this Entity may be stored by the current add-in.

## Syntax (C#)
```csharp
public bool WriteAccessGranted()
```

## Returns
True if write access is allowed.